Revit 2027 API
VerticalAlignmentStyle Enumeration
 Declares the vertical alignment style of font.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum VerticalAlignmentStyle
Public Enumeration VerticalAlignmentStyle
public enum class VerticalAlignmentStyle
type VerticalAlignmentStyle
Members
Member name | Value | Description
Bottom | 8 |  Alignment to bottom
Middle | 4 |  Alignment to middle
Top | 0 |  Alignment to top
See Also
Reference
Autodesk.Revit.DB Namespace